spec/fixtures/stripe_webhooks/customer.subscription.deleted.json

{
  "id": "evt_1CD1H4Dr1pQsxERce024t7mY",
  "object": "event",
  "api_version": "2018-02-06",
  "created": 1522808578,
  "data": {
      "object": {
          "id": "sub_CcFmXH410WdGp1",
          "object": "subscription",
          "application_fee_percent": null,
          "billing": "charge_automatically",
          "billing_cycle_anchor": 1522808577,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1522808577,
          "current_period_end": 1525400577,
          "current_period_start": 1522808577,
          "customer": "cus_CcFlMeAV92yGep",
          "days_until_due": null,
          "discount": null,
          "ended_at": null,
          "items": {
              "object": "list",
              "data": [
                  {
                      "id": "si_CcFmDdVAx5DIvV",
                      "object": "subscription_item",
                      "created": 1522808578,
                      "metadata": {},
                      "plan": {
                          "id": "jobs",
                          "object": "plan",
                          "amount": 0,
                          "billing_scheme": "per_unit",
                          "created": 1522400599,
                          "currency": "usd",
                          "interval": "month",
                          "interval_count": 1,
                          "livemode": true,
                          "metadata": {},
                          "nickname": "Jobs",
                          "product": "prod_CaU6kvMMYsMPsC",
                          "tiers": null,
                          "tiers_mode": null,
                          "transform_usage": null,
                          "trial_period_days": null,
                          "usage_type": "licensed"
                      },
                      "quantity": 1,
                      "subscription": "sub_CcFmXH410WdGp1"
                  },
                  {
                      "id": "si_CcFmyCAigqOvdM",
                      "object": "subscription_item",
                      "created": 1522808578,
                      "metadata": {},
                      "plan": {
                          "id": "community",
                          "object": "plan",
                          "amount": 0,
                          "billing_scheme": "per_unit",
                          "created": 1522400554,
                          "currency": "usd",
                          "interval": "month",
                          "interval_count": 1,
                          "livemode": true,
                          "metadata": {},
                          "nickname": "Community",
                          "product": "prod_CaU68FIxzsRMPa",
                          "tiers": null,
                          "tiers_mode": null,
                          "transform_usage": null,
                          "trial_period_days": null,
                          "usage_type": "licensed"
                      },
                      "quantity": 1,
                      "subscription": "sub_CcFmXH410WdGp1"
                  },
                  {
                    "id": "si_CcFmyCAigqOvdM",
                    "object": "subscription_item",
                    "created": 1522808578,
                    "metadata": {},
                    "plan": {
                        "id": "management",
                        "object": "plan",
                        "amount": 0,
                        "billing_scheme": "per_unit",
                        "created": 1522400554,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": true,
                        "metadata": {},
                        "nickname": "Management",
                        "product": "prod_CZ1Eu8jADpfJtt",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "quantity": 1,
                    "subscription": "sub_CcFmXH410WdGp1"
                }
              ],
              "has_more": false,
              "total_count": 2,
              "url": "/v1/subscription_items?subscription=sub_CcFmXH410WdGp1"
          },
          "livemode": true,
          "metadata": {},
          "plan": null,
          "quantity": null,
          "start": 1522808577,
          "status": "canceled",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
      }
  },
  "livemode": true,
  "pending_webhooks": 1,
  "request": {
      "id": "req_ax36zXjft3FVDe",
      "idempotency_key": null
  },
  "type": "customer.subscription.deleted"
}
